<a href="https://colab.research.google.com/github/jeffersonklamas/Learning_repository/blob/main/Titanic.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

#**Pacotes importados necessários**

---

In [1]:
import pandas as pd
import numpy as np
from sklearn.ensemble import RandomForestClassifier
from sklearn.model_selection import train_test_split

# **Banco de Dados**

## Acesso e leitura

In [2]:
dados = pd.read_csv('/content/train.csv')

In [3]:
dados.head()

   PassengerId  Survived  Pclass  ...       Fare Cabin  Embarked
0            1         0       3  ...     7.2500   NaN         S
1            2         1       1  ...    71.2833   C85         C
2            3         1       3  ...  7925.0000   NaN         S
3            4         1       1  ...    53.1000  C123         S
4            5         0       3  ...     8.0500   NaN         S

[5 rows x 12 columns]

###Eliminando informações no momento desnecessárias

In [4]:
dados = dados.drop(['Name','Ticket','Cabin','Embarked'], axis = 1)

In [5]:
dados.head()

   PassengerId  Survived  Pclass     Sex   Age  SibSp  Parch       Fare
0            1         0       3    male  22.0      1      0     7.2500
1            2         1       1  female  38.0      1      0    71.2833
2            3         1       3  female  26.0      0      0  7925.0000
3            4         1       1  female  35.0      1      0    53.1000
4            5         0       3    male  35.0      0      0     8.0500

#**Chaves e Variáveis Respostas**

In [6]:
dados = dados.set_index(['PassengerId'])
dados = dados.rename(columns = {'Survived': 'target'}, inplace = False)

In [7]:
dados.head()

             target  Pclass     Sex   Age  SibSp  Parch       Fare
PassengerId
1                 0       3    male  22.0      1      0     7.2500
2                 1       1  female  38.0      1      0    71.2833
3                 1       3  female  26.0      0      0  7925.0000
4                 1       1  female  35.0      1      0    53.1000
5                 0       3    male  35.0      0      0     8.0500

#**Descritiva**

In [8]:
dados.describe()

           target      Pclass  ...       Parch           Fare
count  891.000000  891.000000  ...  891.000000     891.000000
mean     0.383838    2.308642  ...    0.381594    4026.270117
std      0.486592    0.836071  ...    0.806057   22153.876204
min      0.000000    1.000000  ...    0.000000       0.000000
25%      0.000000    2.000000  ...    0.000000       8.050000
50%      0.000000    3.000000  ...    0.000000      19.500000
75%      1.000000    3.000000  ...    0.000000      56.929200
max      1.000000    3.000000  ...    6.000000  262375.000000

[8 rows x 6 columns]

In [9]:
dados.describe(include=['O'])

         Sex
count    891
unique     2
top     male
freq     577

#**Transformação de Dados**

In [10]:
dados['sex_f'] = np.where(dados['Sex'] == 'female', 1, 0)

dados['Pclass_1'] = np.where(dados['Pclass'] == 1, 1, 0)
dados['Pclass_2'] = np.where(dados['Pclass'] == 2, 1, 0)
dados['Pclass_3'] = np.where(dados['Pclass'] == 3, 1, 0)

In [11]:
dados = dados.drop(['Pclass','Sex'], axis = 1)

In [12]:
dados.head()

             target   Age  SibSp  Parch  ...  sex_f  Pclass_1  Pclass_2  Pclass_3
PassengerId                              ...
1                 0  22.0      1      0  ...      0         0         0         1
2                 1  38.0      1      0  ...      1         1         0         0
3                 1  26.0      0      0  ...      1         0         0         1
4                 1  35.0      1      0  ...      1         1         0         0
5                 0  35.0      0      0  ...      0         0         0         1

[5 rows x 9 columns]

In [13]:
dados.isnull().sum()

target        0
Age         177
SibSp         0
Parch         0
Fare          0
sex_f         0
Pclass_1      0
Pclass_2      0
Pclass_3      0
dtype: int64

In [14]:
dados.fillna(0, inplace = True)

In [15]:
dados.isnull().sum()

target      0
Age         0
SibSp       0
Parch       0
Fare        0
sex_f       0
Pclass_1    0
Pclass_2    0
Pclass_3    0
dtype: int64

#**Amostragem**

In [17]:
x_train, x_test, y_train, y_test = train_test_split(dados.drop(['target'], axis = 1),
                                                    dados['target'],
                                                    test_size = 0.3,
                                                    random_state = 1234)
[{'treino': x_train.shape},
 {'teste': x_test.shape}]

[{'treino': (623, 8)}, {'teste': (268, 8)}]

#**Modelo**

In [18]:
rndforest = RandomForestClassifier(n_estimators = 1000,
                                   criterion = 'gini',
                                   max_depth = 5)

rndforest.fit(x_train,y_train)

RandomForestClassifier(bootstrap=True, ccp_alpha=0.0, class_weight=None,
                       criterion='gini', max_depth=5, max_features='auto',
                       max_leaf_nodes=None, max_samples=None,
                       min_impurity_decrease=0.0, min_impurity_split=None,
                       min_samples_leaf=1, min_samples_split=2,
                       min_weight_fraction_leaf=0.0, n_estimators=1000,
                       n_jobs=None, oob_score=False, random_state=None,
                       verbose=0, warm_start=False)

In [19]:
probabilidade = rndforest.predict_proba(dados.drop('target', axis = 1))[:,1]
classificacao = rndforest.predict(dados.drop('target', axis = 1))

In [20]:
dados['probabiliade'] = probabilidade
dados['classificacao'] = classificacao

In [21]:
dados

             target   Age  SibSp  ...  Pclass_3  probabiliade  classificacao
PassengerId                       ...
1                 0  22.0      1  ...         1      0.103861              0
2                 1  38.0      1  ...         0      0.930661              1
3                 1  26.0      0  ...         1      0.477050              0
4                 1  35.0      1  ...         0      0.918804              1
5                 0  35.0      0  ...         1      0.117928              0
...             ...   ...    ...  ...       ...           ...            ...
887               0  27.0      0  ...         0      0.129807              0
888               1  19.0      0  ...         0      0.882415              1
889               0   0.0      1  ...         1      0.520281              1
890               1  26.0      0  ...         0      0.462720              0
891               0  32.0      0  ...         1      0.166710              0

[891 rows x 11 columns]